# Лабораторная работа 5, вариант 7, ПГНИУ ЯП МФТИ-1 2022

Решение всех задач оформить в виде одного класса со статическими методами, решающими поставленные задачи. В классе могут присутствовать методы со спецификатором доступа private вспомогательного характера.

## Задание 1. Решить задачу, используя класс List
Составить программу, которая переносит в конец непустого списка L его
первый элемент.
Создаем новый список и добавляем туда 10 случайных чисел.

```c#
List<int> list = new List<int>();
Random rnd = new Random();
Console.WriteLine("Дан список: ");
for (int i = 0; i < 10; ++i)
{
    list.Add(rnd.Next(1, 100));
}
foreach (int i in list)
{
    Console.Write(i + " ");
}

Console.WriteLine();
Console.WriteLine("Ответ: ");
(list[0], list[^1]) = (list[^1], list[0]); //swap
```

И меняем первый и последний элементы местами.

Вывод:
```
ЗАДАЧА 1
Дан список: 
60 5 27 33 17 50 23 76 74 3 
Ответ: 
3 5 27 33 17 50 23 76 74 60 
----------------------------------------
```

## Задание 2. Решить задачу, используя класс LinkedList

из списка L, содержащего не менее двух элементов, удаляет все элементы, у
которых одинаковые «соседи» (первый и последний элементы считать
соседями);

Создаем LinkedList и заполняем его случайными числами

```c#
LinkedList<int> list = new LinkedList<int>();
Random rnd = new Random();
Console.WriteLine("Дан список: ");
for (int i = 0; i < 10; ++i)
{
    list.AddFirst(rnd.Next(1, 10));
}
```

Создаем указатель на первый узел в списке и двигаем его на следующий элемент (это нужно для того, чтобы проверить prev)

```c#
var current = list.First;
current = current.Next;
```

Далее идем по списку пока не достигнем конца и проверяем условие задачи

```c#
while (current != null && current != list.Last && list.Count >= 3)
{
    var old_cur = current;
    if (current.Previous.Value == current.Next.Value)
    {
        old_cur = current;
        list.Remove(current); //удаляем элемент с одинаковыми соседями

    }
    current = old_cur.Next;
}
```

Следующие две проверки позволяют обработать ситуацию, если соседи элемента находятся на разных концах списка:

```c#
if (list.Last.Previous.Value == list.First.Value)
{
    list.Remove(list.Last);
}

if (list.Last.Value == list.First.Next.Value)
{
    list.Remove(list.First);
}
```

Вывод:
```
ЗАДАЧА 2
Дан список: 
6 2 6 1 4 1 1 9 9 7 
Ответ: 
6 6 1 4 1 1 9 9 7 
----------------------------------------
```

## Задание3. Решить задачу, используя класс HashSet

Есть перечень мебельных фабрик, продукция которых представлена в мебельном магазине. Известно, мебель каких фабрик приобреталась n покупателями. Определить для каждой фабрики, мебель каких из них приобреталась всеми покупателями, каких — некоторыми из покупателей, и каких — никем из покупателей.

Идея состоит в том, чтобы использовать ```HashSet``` для хранения названий фабрик, и создать для каждого покупателя свой ```HashSet``` где будут храниться названия фабрик, мебель которых есть у покупателя. Для получения ответа нужно будет использовать пересечения, разность HashSet ов. 

```c#
HashSet<string>[] buyers = new HashSet<string>[k]; //k - покупателей

for (int i = 0; i < k; ++i)
{
    buyers[i] = new HashSet<string>(); //создаем хешсеты для каждого...
}
```

```c#
for (int i = 0; i < k; ++i) //в хешсет кадого покупателя записываем пересечение его хешсета и хешсета фабрик
{
    buyers[i].IntersectWith(fabriques);
}

for (int i = 1; i < k; ++i) //в хешсет 
{
    buyers[0].IntersectWith(buyers[i]);
}



if (buyers[0].Count != 0)
{
    Console.Write("Мебель этих фабрик есть у всех покупателей: ");
    foreach (var i in buyers[0])
    {
        Console.WriteLine(i + " ");
    }
}
else Console.WriteLine("Мебель ни одной фабрики не присутствует у всех покупателей.");
```


Вывод: 
```
ЗАДАНИЕ 3
Название игрушки: Bibi
Цена игрушки: 153$
Можно играть с 2 до 8 лет

Название игрушки: BrawlStars
Цена игрушки: 29$
Можно играть с 4 до 8 лет

Название игрушки: Buzz
Цена игрушки: 190$
Можно играть с 4 до 8 лет

Название игрушки: El Primo
Цена игрушки: 20$
Можно играть с 2 до 11 лет

Название игрушки: Spike
Цена игрушки: 140$
Можно играть с 5 до 8 лет

Название игрушки: Shelly
Цена игрушки: 64$
Можно играть с 3 до 7 лет

Название игрушки: Dymamike
Цена игрушки: 191$
Можно играть с 5 до 8 лет

Название игрушки: Nita
Цена игрушки: 48$
Можно играть с 2 до 6 лет

Название игрушки: Crow
Цена игрушки: 37$
Можно играть с 5 до 6 лет

Название игрушки: Bea
Цена игрушки: 151$
Можно играть с 4 до 8 лет

Bibi Buzz Spike Dymamike Bea 
--------------------------------------------------------------------------------
```
## Задание 4. Решить задачу с использованием структуры «текстовый файл»

Подсчитать количество вхождений максимального элемента в файл.

Абсолютно тривиальное задание, комментировать нечего. Ввод и вывод теперь работают через ```StreamReader``` и ```StreamWriter```:
```c#
StreamReader fin;
StreamWriter fout;
```

А информация из файла считывается в цикле:

```c#
string value;
while ((value = fin.ReadLine()) != null) //пока успешно считывается значение
{
    ...
}
```
Вывод:
```
Данные из файла:
123 12883 2772 126 123 1994 165 295 2547 
Число вхождений максимального элемента равно: 1
--------------------------------------------------------------------------------
```

## Задание 5. Решить задачу с использованием структуры «текстовый файл»
Вычислить количество чётных элементов.

Решение тривиально, полностью повторяет предыдущее.

Вывод:
```
ЗАДАНИЕ 5
Данные из файла: 1212 12 123123 123213 122 123213 
Количество четных элементов равно: 3
--------------------------------------------------------------------------------
```

## Задание 6. Решить задачу с использованием структуры «текстовый файл»
Переписать в другой файл строки, содержащие заданную комбинацию символов. Например, строка «Сегодня старшеклассники выполняли ЕГЭ по информатике и ИКТ» содержит комбинацию «форма».

Решение заключается в поиске подстроки в каждой строке из массива с последующей записью строк с найденным шаблоном в файл вывода:
```c#
while ((value = fin.ReadLine()) != null)
{
    Console.WriteLine(value);
    if (value.Contains(template))
    {
        fout.WriteLine(value);
        ans.Add(value);
    }
}
```
Вывод:

```
ЗАДАНИЕ 6
Данные из файла:
ABOBABOBA
BOBABOBA
BOBOBO
AAAAA
ABOBOBA
Строки, содержащие шаблон ABOBA:
ABOBABOBA
BOBABOBA\
--------------------------------------------------------------------------------
```

